"""
Дан файл, содержащий следующие данные:
th = ['MAC Адрес', 'IP Адрес', 'Mode', 'Rate (Mbps)', 'Signal (%)']
td = ['11:11:11:11:11:11', '192.168.0.103', '11n', '65', '100',
'11:11:11:11:11:11', '192.168.0.103', '11n', '65', '100',
'11:11:11:11:11:11', '192.168.0.103', '11n', '65', '100',
'11:11:11:11:11:11', '192.168.0.103', '11n', '65', '100',
'11:11:11:11:11:11', '192.168.0.103', '11n', '65', '100']
Составьте скрипт, который содержит две функции. Первая (пусть будет inp) 
обеспечивает ввод приведенных выше данных в бинарный файл с помощью библиотеки pickle,
 а вторая функция обеспечивает чтение этих данных с помощью этой же библиотеки и вывода
   таблицы в консоль с помощью библиотеки prettytable.
"""

import pickle
from prettytable import PrettyTable, ALL

NEWFILENAME = 'binary.bat'
th = ['MAC Адрес', 'IP Адрес', 'Mode', 'Rate (Mbps)', 'Signal (%)']
td = [
    ['11:11:11:11:11:11', '192.168.0.103', '11n', '65', '100'],
['11:11:11:11:11:11', '192.168.0.103', '11n', '65', '100'],
['11:11:11:11:11:11', '192.168.0.103', '11n', '65', '100'],
['11:11:11:11:11:11', '192.168.0.103', '11n', '65', '100'],
['11:11:11:11:11:11', '192.168.0.103', '11n', '65', '100']
]

def inp(data1, data2, filename=NEWFILENAME):
    with open(filename, "wb") as file:
        pickle.dump(data1, file)
        pickle.dump(data2, file)
        file.close()

def out(filename=NEWFILENAME):
    with open(filename, 'rb') as file:
        th = pickle.load(file)
        td = pickle.load(file)
    table = PrettyTable()
    table.field_names = th
    table.add_rows(td)
    print(table)
inp(th, td)
out()